1-Pandas e Estrutura de Dados - Series e DataFrame

Estrutura de dados fundamentais: Series e Dataframe. No Pandas, uma Serie e uma estrutura unidimensional, parecida com uma coluna de uma tabela: contém uma sequência de valores com um indice associado Ja um DataFrame é uma estrutura bidimensional, tabela ou matriz, formada por várias colunas (que são internamente, series alinhadas pelo mesmo indice).

In [94]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [95]:
# Criar uma serie (uma unica coluna)

s = pd.Series([10,20,30,40,50], name = 'Valores')

In [96]:
type(s)

pandas.core.series.Series

In [97]:
print('\n_____________________Exemplo de Series_________________________\n')
print(s)
print('\n')
# apresentara os dadoos da lista no formato de uma serie com ideces indexados

_____________________Exemplo de Series_________________________

0    10
1    20
2    30
3    40
4    50
Name: Valores, dtype: int64

In [98]:
# Criar im dicionario em python (os valores nulos seram inclusos como None)
dados = {
    'Nome':['Ana','Bruna','Fabiana','Arnaldo','Eliana','Matias'],
    'Idade':[28,34,29,17, None,78],
    'Cidade':['Blumenau', 'Sao Paulo','Blumenau','Sao Paulo', 'Salvador', 'Sao Paulo'],
    'Salario':[None,7500,6200,9800,8100,15400]
}

In [99]:
type(dados)

dict

In [100]:
print(dados)

{'Nome': ['Ana', 'Bruna', 'Fabiana', 'Arnaldo', 'Eliana', 'Matias'], 'Idade': [28, 34, 29, 17, None, 78], 'Cidade': ['Blumenau', 'Sao Paulo', 'Blumenau', 'Sao Paulo', 'Salvador', 'Sao Paulo'], 'Salario': [None, 7500, 6200, 9800, 8100, 15400]}

In [101]:
df_dsa= pd.DataFrame(dados)

In [102]:
type(df_dsa)

pandas.core.frame.DataFrame

In [103]:
print('\n_______________________Exemplo de DataFrame________________________\n')
print(df_dsa)
print('\n')

_______________________Exemplo de DataFrame________________________

      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  Sao Paulo  15400.0

# 2- leitura e escrita de dados mo formato csv

pandas torna muito facil salvar seu DataFrame em um arquivo CSV e carregá-lo de volta

In [104]:
 # Escrever (salvando) o Dataframe em um arquivo csv
df_dsa.to_csv('dados_funcionarios_sem_indice.csv', index=False, encoding='utf-8')

In [105]:
# index =True (valor Padrao)
df_dsa.to_csv('dados_funcionarios_com_indice.csv', encoding='utf-8')

In [106]:
# Ler dados de um arquivo csv para um novo DataFrame
df_dsa_1 = pd.read_csv('dados_funcionarios_sem_indice.csv')
df_dsa_1.head(6) # a funçao head le as primeiras 5 linhas como padrao,

      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  Sao Paulo  15400.0

In [107]:
df_dsa_2 = pd.read_csv('dados_funcionarios_com_indice.csv')
df_dsa_2.head(6)

   Unnamed: 0     Nome  Idade     Cidade  Salario
0           0      Ana   28.0   Blumenau      NaN
1           1    Bruna   34.0  Sao Paulo   7500.0
2           2  Fabiana   29.0   Blumenau   6200.0
3           3  Arnaldo   17.0  Sao Paulo   9800.0
4           4   Eliana    NaN   Salvador   8100.0
5           5   Matias   78.0  Sao Paulo  15400.0

df_dsa_2 = df_dsa_2.drop(df_dsa_2.columns[0], axis =1)
df_dsa_2.head(6)

3. Seleçao e indexaçao com pandas

existem várias maneiras de selecionar dados de DataFrame. AS mais comuns são loc (baseada em rótulo) e iloc (baseada em posiçao/índice numericos)

In [108]:
df_dsa.head(6)

      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  Sao Paulo  15400.0

In [109]:
nomes = df_dsa['Nome']
print('\n__________________Selecionar a coluna Nome__________________\n')
print(nomes)
print('\n')

__________________Selecionar a coluna Nome__________________

0        Ana
1      Bruna
2    Fabiana
3    Arnaldo
4     Eliana
5     Matias
Name: Nome, dtype: object

In [110]:
type(nomes)

pandas.core.series.Series

In [111]:
# selecionar multiplas colunas (retorna um DataFrame)
info_pessoal = df_dsa[['Nome','Idade']]
print('\n_________________________selecionar as colunas Nome e Idade_____________________\n')
print(info_pessoal)
print('\n')

_________________________selecionar as colunas Nome e Idade_____________________

      Nome  Idade
0      Ana   28.0
1    Bruna   34.0
2  Fabiana   29.0
3  Arnaldo   17.0
4   Eliana    NaN
5   Matias   78.0

In [112]:
type(info_pessoal)

pandas.core.frame.DataFrame

In [113]:
nome = df_dsa.loc[1,'Nome']
print('\n_________________________selecionar com .loc[1,"Nome"]_________________________________________\n', (nome), '\n')

_________________________selecionar com .loc[1,"Nome"]_________________________________________
 Bruna

In [114]:
# Usando .loc para selecionar pela posiçao da linha (linha 2) e da coluna (coluna 3)
salario_fabiana = df_dsa.iloc[2,3]
print('\n_________________________selecionar com .iloc[2,3]_________________________________________\n','Salario R$',(salario_fabiana), '\n')

_________________________selecionar com .iloc[2,3]_________________________________________
 Salario R$ 6200.0

In [115]:
primeiras_tres_linhas = df_dsa.loc[0:2]
print('\n_________________________selecionar as 3 primeiras linhas com .loc_________________________________________\n')
print(primeiras_tres_linhas)

_________________________selecionar as 3 primeiras linhas com .loc_________________________________________

      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0

# 4 filtragem de dados com pandas

Voce pode filtrar linhas com base em condiçoes logicas, de forma ,uito intuitiva, bem como usar colunas com índice

In [116]:
df_dsa = df_dsa.set_index(df_dsa.columns[0])
df_dsa.head(6)

         Idade     Cidade  Salario
Nome
Ana       28.0   Blumenau      NaN
Bruna     34.0  Sao Paulo   7500.0
Fabiana   29.0   Blumenau   6200.0
Arnaldo   17.0  Sao Paulo   9800.0
Eliana     NaN   Salvador   8100.0
Matias    78.0  Sao Paulo  15400.0

In [117]:
#Filtragem usando label do uindice (linha) e da coluna
# df_dsa.loc['Fabiana','Salário']

In [118]:
#resetar
df_dsa=df_dsa.reset_index()

In [119]:
df_dsa.head(6)

      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  Sao Paulo  15400.0

In [120]:
#filtrar idades de funcionarios
mais_de_30 = df_dsa[df_dsa['Idade']>30]
print('\n____________________________Funcionários com mais de 30 anos______________________________')
print(mais_de_30)
print('\n')

____________________________Funcionários com mais de 30 anos______________________________
     Nome  Idade     Cidade  Salario
1   Bruna   34.0  Sao Paulo   7500.0
5  Matias   78.0  Sao Paulo  15400.0

In [121]:
#Filtrar funcionarios de Sao Paulo com salario a cima e 6000
sp_salario_alto = df_dsa[(df_dsa['Cidade']=='Sao Paulo')&(df_dsa['Salario']>6000)]
print('\n____________________________________________Funcionarios de Sao Paulo com salario > 6 mil_____________________________')
print(sp_salario_alto)
print('\n')

____________________________________________Funcionarios de Sao Paulo com salario > 6 mil_____________________________
      Nome  Idade     Cidade  Salario
1    Bruna   34.0  Sao Paulo   7500.0
3  Arnaldo   17.0  Sao Paulo   9800.0
5   Matias   78.0  Sao Paulo  15400.0

In [122]:
#verificar quais celulas tem valor nulo
df_dsa.isnull()

    Nome  Idade  Cidade  Salario
0  False  False   False     True
1  False  False   False    False
2  False  False   False    False
3  False  False   False    False
4  False   True   False    False
5  False  False   False    False

In [123]:
df_dsa.isnull().any()

Nome       False
Idade       True
Cidade     False
Salario     True
dtype: bool

In [124]:
df_dsa_colunas_com_nulos = df_dsa.loc[:,df_dsa.isnull().any()]

In [125]:
df_dsa_colunas_com_nulos.head()

   Idade  Salario
0   28.0      NaN
1   34.0   7500.0
2   29.0   6200.0
3   17.0   9800.0
4    NaN   8100.0

In [126]:
df_dsa_colunas_com_nulos = df_dsa[df_dsa.isnull().any(axis=1)]

In [127]:
df_dsa_colunas_com_nulos.head()

     Nome  Idade    Cidade  Salario
0     Ana   28.0  Blumenau      NaN
4  Eliana    NaN  Salvador   8100.0

In [128]:
linhas_com_nulos_idade = df_dsa[df_dsa['Idade'].isnull()]
linhas_com_nulos_idade.head

<bound method NDFrame.head of      Nome  Idade    Cidade  Salario
4  Eliana    NaN  Salvador   8100.0>

In [129]:
print(f'\n______________Formato do DataFrame .shape________________\n{df_dsa.shape}')

______________Formato do DataFrame .shape________________
(6, 4)

In [130]:
print(f'\n______________Formato do DataFrame .shape________________\n{df_dsa.head()}')

______________Formato do DataFrame .shape________________
      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0

In [131]:
print(f'\n______________Formato do DataFrame .shape________________\n{df_dsa.tail()}')

______________Formato do DataFrame .shape________________
      Nome  Idade     Cidade  Salario
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0
5   Matias   78.0  Sao Paulo  15400.0

In [132]:
print(f'\n______________Informações Gerais________________\n{df_dsa.info()}')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 6 entries, 0 to 5
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Nome     6 non-null      object
 1   Idade    5 non-null      float64
 2   Cidade   6 non-null      object
 3   Salario  5 non-null      float64
dtypes: float64(2), object(2)
memory usage: 324.0+ bytes

______________Informações Gerais________________
None

In [133]:
print(f'\n______________Estatisticas descritivas________________\n{df_dsa.describe()}')

______________Estatisticas descritivas________________
           Idade       Salario
count   5.000000      5.000000
mean   37.200000   9400.000000
std    23.636836   3595.135602
min    17.000000   6200.000000
25%    28.000000   7500.000000
50%    29.000000   8100.000000
75%    34.000000   9800.000000
max    78.000000  15400.000000

In [134]:
print(df_dsa.describe(include='all'))# para incluir tudo

       Nome      Idade     Cidade       Salario
count     6   5.000000          6      5.000000
unique    6        NaN          3           NaN
top     Ana        NaN  Sao Paulo           NaN
freq      1        NaN          3           NaN
mean    NaN  37.200000        NaN   9400.000000
std     NaN  23.636836        NaN   3595.135602
min     NaN  17.000000        NaN   6200.000000
25%     NaN  28.000000        NaN   7500.000000
50%     NaN  29.000000        NaN   8100.000000
75%     NaN  34.000000        NaN   9800.000000
max     NaN  78.000000        NaN  15400.000000

In [135]:
df_dsa.describe(include=[object])# colunas do tipo objeto

       Nome     Cidade
count     6          6
unique    6          3
top     Ana  Sao Paulo
freq      1          3

In [136]:
df_dsa.describe(include=[np.number])

           Idade       Salario
count   5.000000      5.000000
mean   37.200000   9400.000000
std    23.636836   3595.135602
min    17.000000   6200.000000
25%    28.000000   7500.000000
50%    29.000000   8100.000000
75%    34.000000   9800.000000
max    78.000000  15400.000000

6 Operaçoes e trnsformaçoes

voce pode facilmente criar novascilunas a partir de outras ou aplicar funçoes para modificar os dados. Fazemos isso com frequencia em tarefas de engenharia de atributos em projetos de ciencias de dados

In [137]:
df_dsa.head()

      Nome  Idade     Cidade  Salario
0      Ana   28.0   Blumenau      NaN
1    Bruna   34.0  Sao Paulo   7500.0
2  Fabiana   29.0   Blumenau   6200.0
3  Arnaldo   17.0  Sao Paulo   9800.0
4   Eliana    NaN   Salvador   8100.0

In [138]:
# criar uma nova coluna de salario anual
df_dsa['Salário Anual']= df_dsa['Salario']* 12
print('\n_____________________DataFrame com nova coluna "Salario Anual"________________________')
print(df_dsa)
print('\n')

_____________________DataFrame com nova coluna "Salario Anual"________________________
      Nome  Idade     Cidade  Salario  Salário Anual
0      Ana   28.0   Blumenau      NaN            NaN
1    Bruna   34.0  Sao Paulo   7500.0        90000.0
2  Fabiana   29.0   Blumenau   6200.0        74400.0
3  Arnaldo   17.0  Sao Paulo   9800.0       117600.0
4   Eliana    NaN   Salvador   8100.0        97200.0
5   Matias   78.0  Sao Paulo  15400.0       184800.0

In [139]:
df_dsa['Bonus']=df_dsa['Salario'].apply(lamba x: x * 0.10 if x > 7000 else x 0.05)
print('\n_____________________DataFrame com nova colua "Bonus"___________________\n')
print(df_dsa)
print('\n')

SyntaxError: invalid syntax. Perhaps you forgot a comma? (4190803482.py, line 1)

In [ ]:
condicoes = [
    df_dsa['Idade']<18,
    (df_dsa['Idade']>=18)&(df_dsa['Idade']<=30),
    (df_dsa['Idade']>30)&(df_dsa['Idade']<=60),
    df_dsa['Idade']>60



]

In [ ]:
print(condicoes)

In [ ]:
faixas = ['Menor de idade','Jovem', 'Adulto', 'Idoso']

In [ ]:
df_dsa['Faixa Etátia']= np.select(condicoes, faixas, default='Idade Não Informada')

In [ ]:
df_dsa.head()

7 Agrupamento de Dados (Group By) com Pandas

o metodo groupby é extremamente poderoso para analise segmentadas. é exatamente o mesmo conceito usado na lingaugem SQL.

In [ ]:
df_dsa.head()

In [ ]:
#agrupar dados
media_salario_cidade = df_dsa.groupby('Cidade')['Salario'].mean()
print('\n___________________________Media de Salario por Cidade____________________________\n')
print(np.round(media_salario_cidade),2)
print('\n')

In [140]:
#Agrupar cidade e calcular multiplas agregaçoes
agregacao_cidade = df_dsa.groupby('Cidade').agg(Medias_Salarial=('Salario','mean'),
                                            Idade_Maxima = ('Idade', 'max'),
                                            contagem = ('Nome', 'count'))
print(agregacao_cidade)

           Medias_Salarial  Idade_Maxima  contagem
Cidade
Blumenau            6200.0          29.0         2
Salvador            8100.0           NaN         1
Sao Paulo          10900.0          78.0         3

8 Maipulaçao de tipos de dados com pandas

Garantir que cada coluna tenha o tipo de dado correto é fundamental para qualquer tipo de analise